; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	thermograph1 - mode
	infrared0 - mode
	Star0 - direction
	Star1 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	Star9 - direction
	Star12 - direction
	GroundStation7 - direction
	Star10 - direction
	Star3 - direction
	Star11 - direction
	GroundStation2 - direction
	Star6 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star10)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Planet13 infrared0)
	(have_image Phenomenon14 infrared0)
	(have_image Planet15 infrared0)
	(have_image Star16 thermograph1)
	(have_image Phenomenon17 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 planet13 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet13)
   goals met: 0 of 5
4. (take_image satellite0 planet13 instrument1 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 1 of 5
5. (turn_to satellite0 phenomenon17 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 5
6. (take_image satellite0 phenomenon17 instrument1 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 2 of 5
7. (turn_to satellite0 phenomenon14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 5
8. (take_image satellite0 phenomenon14 instrument1 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 3 of 5
9. (turn_to satellite0 planet15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet15)
   goals met: 3 of 5
10. (take_image satellite0 planet15 instrument1 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 4 of 5
11. (turn_to satellite0 star16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star16)
   goals met: 4 of 5
12. (take_image satellite0 star16 instrument1 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 5 of 5
